app/Controllers/UserController.php

    public function tampil()
    {
        #code...
        //$users = new Users();
        $data['data'] = $this->users->findAll();
---
SELECT *
FROM `tb_user`

    public function create()
    {
        #code...
        $data = array(
            'nama'=>$this->request->getPost('nama'),
            'username'=>$this->request->getPost('username'),
            'password'=>password_hash ($this->request->getPost('password'),PASSWORD_DEFAULT),
            'role'=>$this->request->getPost('role'),
        );
        $this->users->insert($data);
---
INSERT INTO `tb_user` (`nama`, `username`, `password`, `role`) VALUES ('laila', 'Alesa', '$2y$10$bKfilnPxdU9pkAO5tAJT4utOwqhamlcDIBNNNzIBbtF3P6RkFQ1fa', 'admin')

    public function login()
    {
        $session = session();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $data = $this->users->where('username', $username)->first();
---
SELECT *
FROM `tb_user`
WHERE `username` = 'Alesa'
 LIMIT 1